---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceLoadData.GetExternalResourceReference
source: html/9d7e42c8-561c-374b-e8d9-d16c1f46dfa9.htm
---
# Autodesk.Revit.DB.ExternalResourceLoadData.GetExternalResourceReference Method

Returns the ExternalResourceReference that identifies which resource should be loaded.

## Syntax (C#)
```csharp
public ExternalResourceReference GetExternalResourceReference()
```

## Remarks
Information in this object tells the server from which specific resource Revit
 expects to receive the external data.